pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
#pragma once
/**
 * @file hal/stm32h562/regs.h
 * @brief Definições de registradores do STM32H562RGT6 (ARM Cortex-M33 @ 250 MHz)
 *
 * Cobertura: RCC, GPIO, TIM2/TIM3/TIM4/TIM5/TIM6/TIM8, ADC1/ADC2, GPDMA1,
 *            FDCAN1, USART1, IWDG, SysTick (via CMSIS), Flash OPTCR/SR, NVIC helpers.
 *
 * Todos os endereços baseados em:
 *   RM0481 — STM32H523/33xx, STM32H562/63xx e STM32H573xx Reference Manual Rev 4
 */

#include <cstdint>

// ─── Macro de acesso a registrador ────────────────────────────────────────────
#define STM32_REG32(addr)  (*reinterpret_cast<volatile uint32_t*>(addr))
#define STM32_REG16(addr)  (*reinterpret_cast<volatile uint16_t*>(addr))

// ─── Bases dos periféricos (RM0481 §3.3, Memory Map) ─────────────────────────
// AHB1
#define GPIOA_BASE   0x42020000UL
#define GPIOB_BASE   0x42020400UL
#define GPIOC_BASE   0x42020800UL
#define GPIOD_BASE   0x42020C00UL
#define GPIOE_BASE   0x42021000UL

// APB1/APB2 timers
#define TIM2_BASE    0x40000000UL
#define TIM3_BASE    0x40000400UL
#define TIM4_BASE    0x40000800UL
#define TIM5_BASE    0x40000C00UL
#define TIM6_BASE    0x40001000UL
#define TIM1_BASE    0x40012C00UL
#define TIM8_BASE    0x40013400UL
#define USART1_BASE  0x40013800UL
#define USART2_BASE  0x40004400UL

// AHB2 — ADC (CMSIS verified: AHB2PERIPH 0x42020000 + 0x8000/0x8100/0x8300)
// Os endereços antigos (0x42022400...) caíam em região sem periférico → acesso
// travava o barramento AHB para sempre (sem fault) até o IWDG resetar.
#define ADC1_BASE    0x42028000UL
#define ADC2_BASE    0x42028100UL
#define ADC12_COMMON 0x42028300UL

// APB1 — FDCAN
#define FDCAN1_BASE  0x4000A400UL
#define FDCAN_SRAM   0x4000AC00UL   // Message RAM

// AHB1 — GPDMA
#define GPDMA1_BASE  0x40020000UL

// APB1 — SPI2
#define SPI2_BASE    0x40003800UL

// APB1 — IWDG
#define IWDG_BASE    0x40003000UL

// PWR (AHB3, offset 0x800 from AHB3PERIPH_BASE_NS=0x44020000)
// Confirmed addresses from stm32h562xx.h PWR_TypeDef struct
#define PWR_BASE     0x44020800UL
#define PWR_VOSCR    STM32_REG32(PWR_BASE + 0x10UL)  // Voltage Scaling Control Register
#define PWR_VOSSR    STM32_REG32(PWR_BASE + 0x14UL)  // Voltage Scaling Status Register
#define PWR_USBSCR   STM32_REG32(PWR_BASE + 0x38UL)  // USB Supply Control Register
#define PWR_VMSR     STM32_REG32(PWR_BASE + 0x3CUL)  // Voltage Monitoring Status Register
// PWR_VOSCR VOS[5:4] bits: 11b=VOS0 (up to 250 MHz), reset=VOS3 (00b, up to ~100 MHz only)
#define PWR_VOSCR_VOS_MSK    (3u << 4u)
#define PWR_VOSCR_VOS0       (3u << 4u)  // 11b: Scale 0, max HCLK 250 MHz
#define PWR_VOSSR_VOSRDY     (1u << 3u)  // Voltage scaling ready flag
#define PWR_VOSSR_ACTVOSRDY  (1u << 13u) // VOS aplicado e pronto (CMSIS pos 13)
#define PWR_VOSSR_ACTVOS_MSK (3u << 14u) // VOS efetivamente em uso (CMSIS pos 14)
#define PWR_VOSSR_ACTVOS_VOS0 (3u << 14u)
// PWR_USBSCR bits (confirmed from stm32h562xx.h)
#define PWR_USBSCR_USB33DEN  (1u << 24u)  // VDDUSB voltage detector enable
#define PWR_USBSCR_USB33SV   (1u << 25u)  // VDDUSB 3.3V supply enable (required for USB PHY)
#define PWR_VMSR_USB33RDY    (1u << 24u)  // VDDUSB 3.3V ready flag

// RCC
#define RCC_BASE     0x44020C00UL

// Flash
#define FLASH_BASE   0x40022000UL

// ─── RCC (Reset and Clock Control) ───────────────────────────────────────────
#define RCC_CR          STM32_REG32(RCC_BASE + 0x000)
#define RCC_CFGR1       STM32_REG32(RCC_BASE + 0x01C)
#define RCC_CFGR2       STM32_REG32(RCC_BASE + 0x020)
#define RCC_PLL1CFGR    STM32_REG32(RCC_BASE + 0x028)
#define RCC_PLL1DIVR    STM32_REG32(RCC_BASE + 0x034)
#define RCC_AHB1ENR     STM32_REG32(RCC_BASE + 0x088)  // AHB1ENR offset 0x88 (CMSIS verified; 0xE8 é o CCIPR5!)
#define RCC_AHB2ENR1    STM32_REG32(RCC_BASE + 0x08C)  // AHB2ENR offset 0x8C (CMSIS verified)
#define RCC_APB1LENR    STM32_REG32(RCC_BASE + 0x09C)  // APB1LENR offset 0x9C (CMSIS verified; 0xF4 é o RSR!)
#define RCC_APB2ENR     STM32_REG32(RCC_BASE + 0x0A4)  // APB2ENR offset 0xA4 (CMSIS verified)

// RCC_CR bits
#define RCC_CR_HSEON    (1u << 16)
#define RCC_CR_HSERDY   (1u << 17)
#define RCC_CR_PLL1ON   (1u << 24)
#define RCC_CR_PLL1RDY  (1u << 25)

// RCC_CFGR1 bits (SW[2:0] / SWS[2:0])
#define RCC_CFGR1_SW_PLL1  (3u << 0)
#define RCC_CFGR1_SWS_PLL1 (3u << 3)

// Clock enables
// ─── GTZC (TrustZone controller — RM0481 §11) ──────────────────────────────
#define GTZC1_BASE              0x40032400UL
#define GTZC1_TZSC_SECCFGR1     STM32_REG32(GTZC1_BASE + 0x10UL)
#define GTZC1_TZSC_SECCFGR2     STM32_REG32(GTZC1_BASE + 0x14UL)
#define GTZC1_TZSC_SECCFGR3     STM32_REG32(GTZC1_BASE + 0x18UL)
#define GTZC1_MPCBB1_CR         STM32_REG32(0x40032C00UL)
#define GTZC1_MPCBB2_CR         STM32_REG32(0x40033000UL)
#define GTZC1_MPCBB3_CR         STM32_REG32(0x40033400UL)

#define RCC_AHB2ENR1_GPIOAEN  (1u << 0)
#define RCC_AHB2ENR1_GPIOBEN  (1u << 1)
#define RCC_AHB2ENR1_GPIOCEN  (1u << 2)
#define RCC_AHB2ENR1_GPIODEN  (1u << 3)
#define RCC_AHB2ENR1_GPIOEEN  (1u << 4)
#define RCC_AHB1ENR_GPDMA1EN  (1u << 0)
// ADC no H562 fica no AHB2 (RCC_AHB2ENR_ADCEN bit 10, CMSIS verified) — o define
// antigo RCC_AHB1ENR_ADC12EN (bit 5 do AHB1ENR) não habilitava clock nenhum do ADC.
#define RCC_AHB2ENR1_ADCEN    (1u << 10)
#define RCC_APB1LENR_TIM2EN   (1u << 0)
#define RCC_APB1LENR_TIM3EN   (1u << 1)
#define RCC_APB1LENR_TIM4EN   (1u << 2)
#define RCC_APB1LENR_TIM5EN   (1u << 3)
#define RCC_APB1LENR_TIM6EN   (1u << 4)
#define RCC_APB1LENR_FDCAN1EN (1u << 9)
#define RCC_APB1LENR_IWDGEN   (1u << 12)
#define RCC_APB1LENR_SPI2EN   (1u << 14)
#define RCC_APB1LENR_USART2EN (1u << 17)
#define RCC_APB1LENR_CRSEN    (1u << 24u)  // CRS clock enable (APB1, bit 24)
#define RCC_APB2ENR_TIM1EN    (1u << 11)
#define RCC_APB2ENR_TIM8EN    (1u << 13)
#define RCC_APB2ENR_USART1EN  (1u << 14)

// ─── GPIO (RM0481 §17) ────────────────────────────────────────────────────────
// Offsets comuns a GPIOA..GPIOE
#define GPIO_MODER_OFF   0x00UL
#define GPIO_OTYPER_OFF  0x04UL
#define GPIO_OSPEEDR_OFF 0x08UL
#define GPIO_PUPDR_OFF   0x0CUL
#define GPIO_IDR_OFF     0x10UL
#define GPIO_ODR_OFF     0x14UL
#define GPIO_BSRR_OFF    0x18UL
#define GPIO_AFRL_OFF    0x20UL
#define GPIO_AFRH_OFF    0x24UL

#define GPIOA_MODER   STM32_REG32(GPIOA_BASE + GPIO_MODER_OFF)
#define GPIOA_OSPEEDR STM32_REG32(GPIOA_BASE + GPIO_OSPEEDR_OFF)
#define GPIOA_AFRL    STM32_REG32(GPIOA_BASE + GPIO_AFRL_OFF)
#define GPIOA_AFRH    STM32_REG32(GPIOA_BASE + GPIO_AFRH_OFF)
#define GPIOA_PUPDR   STM32_REG32(GPIOA_BASE + GPIO_PUPDR_OFF)
#define GPIOA_IDR     STM32_REG32(GPIOA_BASE + GPIO_IDR_OFF)
#define GPIOA_BSRR    STM32_REG32(GPIOA_BASE + GPIO_BSRR_OFF)

#define GPIOB_MODER   STM32_REG32(GPIOB_BASE + GPIO_MODER_OFF)
#define GPIOB_ODR     STM32_REG32(GPIOB_BASE + GPIO_ODR_OFF)
#define GPIOB_OSPEEDR STM32_REG32(GPIOB_BASE + GPIO_OSPEEDR_OFF)
#define GPIOB_AFRL    STM32_REG32(GPIOB_BASE + GPIO_AFRL_OFF)
#define GPIOB_AFRH    STM32_REG32(GPIOB_BASE + GPIO_AFRH_OFF)
#define GPIOB_BSRR    STM32_REG32(GPIOB_BASE + GPIO_BSRR_OFF)

#define GPIOC_MODER   STM32_REG32(GPIOC_BASE + GPIO_MODER_OFF)
#define GPIOC_OSPEEDR STM32_REG32(GPIOC_BASE + GPIO_OSPEEDR_OFF)
#define GPIOC_AFRL    STM32_REG32(GPIOC_BASE + GPIO_AFRL_OFF)
#define GPIOC_AFRH    STM32_REG32(GPIOC_BASE + GPIO_AFRH_OFF)
#define GPIOC_BSRR    STM32_REG32(GPIOC_BASE + GPIO_BSRR_OFF)

#define GPIOD_MODER   STM32_REG32(GPIOD_BASE + GPIO_MODER_OFF)
#define GPIOD_OSPEEDR STM32_REG32(GPIOD_BASE + GPIO_OSPEEDR_OFF)
#define GPIOD_AFRL    STM32_REG32(GPIOD_BASE + GPIO_AFRL_OFF)
#define GPIOD_AFRH    STM32_REG32(GPIOD_BASE + GPIO_AFRH_OFF)
#define GPIOD_BSRR    STM32_REG32(GPIOD_BASE + GPIO_BSRR_OFF)

#define GPIOE_MODER   STM32_REG32(GPIOE_BASE + GPIO_MODER_OFF)
#define GPIOE_OSPEEDR STM32_REG32(GPIOE_BASE + GPIO_OSPEEDR_OFF)
#define GPIOE_AFRL    STM32_REG32(GPIOE_BASE + GPIO_AFRL_OFF)
#define GPIOE_AFRH    STM32_REG32(GPIOE_BASE + GPIO_AFRH_OFF)
#define GPIOE_BSRR    STM32_REG32(GPIOE_BASE + GPIO_BSRR_OFF)
#define GPIOE_ODR     STM32_REG32(GPIOE_BASE + GPIO_ODR_OFF)

