pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
// GPIO MODER values (2 bits por pino)
#define GPIO_MODER_INPUT  0x0u
#define GPIO_MODER_OUTPUT 0x1u
#define GPIO_MODER_AF     0x2u
#define GPIO_MODER_ANALOG 0x3u

// GPIO OSPEEDR values
#define GPIO_OSPEED_LOW    0x0u
#define GPIO_OSPEED_MEDIUM 0x1u
#define GPIO_OSPEED_HIGH   0x2u
#define GPIO_OSPEED_VHIGH  0x3u

// Alternate Functions relevantes:
//   AF1  = TIM1/TIM2          AF2  = TIM3/TIM4/TIM5
//   AF7  = USART1/USART2/USART3
//   AF9  = FDCAN1/FDCAN2
#define GPIO_AF1   1u
#define GPIO_AF2   2u
#define GPIO_AF3   3u
#define GPIO_AF4   4u
#define GPIO_AF5   5u
#define GPIO_AF7   7u
#define GPIO_AF9   9u
#define GPIO_AF12  12u

static inline void gpio_set_output(volatile uint32_t* moder,
                                   volatile uint32_t* ospeedr,
                                   uint8_t pin) noexcept {
    *moder = (*moder & ~(3u << (pin * 2u))) | (GPIO_MODER_OUTPUT << (pin * 2u));
    *ospeedr = (*ospeedr & ~(3u << (pin * 2u))) | (GPIO_OSPEED_VHIGH << (pin * 2u));
}

// Inline: configura pino como AF
static inline void gpio_set_af(volatile uint32_t* moder,
                                volatile uint32_t* afr_l,
                                volatile uint32_t* afr_h,
                                volatile uint32_t* ospeedr,
                                uint8_t pin, uint8_t af) noexcept {
    // MODER = AF (10b)
    *moder = (*moder & ~(3u << (pin * 2u))) | (GPIO_MODER_AF << (pin * 2u));
    // OSPEEDR = very high
    *ospeedr = (*ospeedr & ~(3u << (pin * 2u))) | (GPIO_OSPEED_VHIGH << (pin * 2u));
    // AFR
    if (pin < 8u) {
        *afr_l = (*afr_l & ~(0xFu << (pin * 4u))) | (static_cast<uint32_t>(af) << (pin * 4u));
    } else {
        uint8_t p = pin - 8u;
        *afr_h = (*afr_h & ~(0xFu << (p * 4u))) | (static_cast<uint32_t>(af) << (p * 4u));
    }
}

// Inline: configura pino como ANALOG (ADC)
static inline void gpio_set_analog(volatile uint32_t* moder, uint8_t pin) noexcept {
    *moder = (*moder & ~(3u << (pin * 2u))) | (GPIO_MODER_ANALOG << (pin * 2u));
}

// ─── TIM genérico (offsets, RM0481 §33) ──────────────────────────────────────
#define TIM_CR1_OFF   0x00UL   // Control register 1
#define TIM_CR2_OFF   0x04UL   // Control register 2
#define TIM_SMCR_OFF  0x08UL   // Slave mode control
#define TIM_DIER_OFF  0x0CUL   // DMA/interrupt enable
#define TIM_SR_OFF    0x10UL   // Status register
#define TIM_EGR_OFF   0x14UL   // Event generation
#define TIM_CCMR1_OFF 0x18UL   // Capture/compare mode 1
#define TIM_CCMR2_OFF 0x1CUL   // Capture/compare mode 2
#define TIM_CCER_OFF  0x20UL   // Capture/compare enable
#define TIM_CNT_OFF   0x24UL   // Counter
#define TIM_PSC_OFF   0x28UL   // Prescaler
#define TIM_ARR_OFF   0x2CUL   // Auto-reload
#define TIM_RCR_OFF   0x30UL   // Repetition counter (advanced timers TIM1/TIM8)
#define TIM_CCR1_OFF  0x34UL   // Capture/compare 1
#define TIM_CCR2_OFF  0x38UL   // Capture/compare 2
#define TIM_CCR3_OFF  0x3CUL   // Capture/compare 3
#define TIM_CCR4_OFF  0x40UL   // Capture/compare 4
#define TIM_BDTR_OFF  0x44UL   // Break and dead-time (TIM1 only)
#define TIM_CR2_MMS_UPDATE (2u << 4)   // MMS = 010 → Update event → TRGO

// TIM_CR1 bits
#define TIM_CR1_CEN   (1u << 0)   // Counter enable
#define TIM_CR1_UDIS  (1u << 1)   // Update disable
#define TIM_CR1_URS   (1u << 2)   // Update request source
#define TIM_CR1_OPM   (1u << 3)   // One-pulse mode
#define TIM_CR1_ARPE  (1u << 7)   // Auto-reload preload enable

// TIM_EGR bits
#define TIM_EGR_UG    (1u << 0)   // Update generation

// TIM_BDTR bits (advanced timers TIM1/TIM8)
#define TIM_BDTR_MOE  (1u << 15)  // Main output enable

// TIM_SR bits
#define TIM_SR_UIF    (1u << 0)   // Update interrupt flag
#define TIM_SR_CC1IF  (1u << 1)   // Capture/compare 1
#define TIM_SR_CC2IF  (1u << 2)   // Capture/compare 2
#define TIM_SR_CC3IF  (1u << 3)   // Capture/compare 3
#define TIM_SR_CC4IF  (1u << 4)   // Capture/compare 4
#define TIM_SR_CC1OF  (1u << 9)   // Overcapture 1

// TIM_DIER bits
#define TIM_DIER_UIE  (1u << 0)
#define TIM_DIER_CC1IE (1u << 1)
#define TIM_DIER_CC2IE (1u << 2)
#define TIM_DIER_CC3IE (1u << 3)
#define TIM_DIER_CC4IE (1u << 4)

// TIM_CCMR1 — Capture/Compare Mode (CH1 e CH2)
// Input Capture
#define TIM_CCMR1_CC1S_TI1  (1u << 0)   // CH1 → IC, mapeado em TI1
#define TIM_CCMR1_CC2S_TI2  (1u << 8)   // CH2 → IC, mapeado em TI2
#define TIM_CCMR1_IC1F_NONE (0u << 4)   // sem filtro
#define TIM_CCMR1_IC2F_NONE (0u << 12)
// Output Compare
#define TIM_CCMR1_OC1M_FROZEN  (0u << 4)
#define TIM_CCMR1_OC1M_ACTIVE  (1u << 4)
#define TIM_CCMR1_OC1M_INACTIVE (2u << 4)
#define TIM_CCMR1_OC1M_FORCE_INACTIVE (4u << 4)
#define TIM_CCMR1_OC1M_FORCE_ACTIVE (5u << 4)
#define TIM_CCMR1_OC1M_PWM1    (6u << 4)
#define TIM_CCMR1_OC2M_FROZEN  (0u << 12)
#define TIM_CCMR1_OC2M_ACTIVE  (1u << 12)
#define TIM_CCMR1_OC2M_INACTIVE (2u << 12)
#define TIM_CCMR1_OC2M_FORCE_INACTIVE (4u << 12)
#define TIM_CCMR1_OC2M_FORCE_ACTIVE (5u << 12)
#define TIM_CCMR1_OC2M_PWM1    (6u << 12)
#define TIM_CCMR1_OC1PE        (1u << 3)   // preload enable CH1
#define TIM_CCMR1_OC2PE        (1u << 11)

// TIM_CCMR2 — CH3 e CH4
#define TIM_CCMR2_OC3M_ACTIVE (1u << 4)
#define TIM_CCMR2_OC3M_INACTIVE (2u << 4)
#define TIM_CCMR2_OC3M_FORCE_INACTIVE (4u << 4)
#define TIM_CCMR2_OC3M_FORCE_ACTIVE (5u << 4)
#define TIM_CCMR2_OC3M_PWM1   (6u << 4)
#define TIM_CCMR2_OC4M_ACTIVE (1u << 12)
#define TIM_CCMR2_OC4M_INACTIVE (2u << 12)
#define TIM_CCMR2_OC4M_FORCE_INACTIVE (4u << 12)
#define TIM_CCMR2_OC4M_FORCE_ACTIVE (5u << 12)
#define TIM_CCMR2_OC4M_PWM1   (6u << 12)
#define TIM_CCMR2_OC3PE       (1u << 3)
#define TIM_CCMR2_OC4PE       (1u << 11)

// TIM_CCER bits (enable + polarity per channel)
#define TIM_CCER_CC1E   (1u << 0)
#define TIM_CCER_CC1P   (1u << 1)   // polarity (0=active high, 1=active low)
#define TIM_CCER_CC1NE  (1u << 2)   // complementary output enable CH1N (advanced timers)
#define TIM_CCER_CC1NP  (1u << 3)   // input capture: 0=rising, 1=falling, 11=both
#define TIM_CCER_CC2E   (1u << 4)
#define TIM_CCER_CC2P   (1u << 5)
#define TIM_CCER_CC3E   (1u << 8)
#define TIM_CCER_CC4E   (1u << 12)


// TIM1 — advanced timer (ignition output compare on LQFP100)
#define TIM1_CR1   STM32_REG32(TIM1_BASE + TIM_CR1_OFF)
#define TIM1_DIER  STM32_REG32(TIM1_BASE + TIM_DIER_OFF)
#define TIM1_SR    STM32_REG32(TIM1_BASE + TIM_SR_OFF)
#define TIM1_EGR   STM32_REG32(TIM1_BASE + TIM_EGR_OFF)
#define TIM1_CCMR1 STM32_REG32(TIM1_BASE + TIM_CCMR1_OFF)
#define TIM1_CCMR2 STM32_REG32(TIM1_BASE + TIM_CCMR2_OFF)
#define TIM1_CCER  STM32_REG32(TIM1_BASE + TIM_CCER_OFF)
#define TIM1_CNT   STM32_REG32(TIM1_BASE + TIM_CNT_OFF)
#define TIM1_PSC   STM32_REG32(TIM1_BASE + TIM_PSC_OFF)
#define TIM1_ARR   STM32_REG32(TIM1_BASE + TIM_ARR_OFF)
#define TIM1_RCR   STM32_REG32(TIM1_BASE + TIM_RCR_OFF)
#define TIM1_CCR1  STM32_REG32(TIM1_BASE + TIM_CCR1_OFF)
#define TIM1_CCR2  STM32_REG32(TIM1_BASE + TIM_CCR2_OFF)
#define TIM1_CCR3  STM32_REG32(TIM1_BASE + TIM_CCR3_OFF)
#define TIM1_CCR4  STM32_REG32(TIM1_BASE + TIM_CCR4_OFF)
#define TIM1_BDTR  STM32_REG32(TIM1_BASE + TIM_BDTR_OFF)

// TIM2 — 32-bit output compare for injection events
#define TIM2_CR1   STM32_REG32(TIM2_BASE + TIM_CR1_OFF)
#define TIM2_DIER  STM32_REG32(TIM2_BASE + TIM_DIER_OFF)
#define TIM2_SR    STM32_REG32(TIM2_BASE + TIM_SR_OFF)
#define TIM2_EGR   STM32_REG32(TIM2_BASE + TIM_EGR_OFF)
#define TIM2_CCMR1 STM32_REG32(TIM2_BASE + TIM_CCMR1_OFF)
#define TIM2_CCMR2 STM32_REG32(TIM2_BASE + TIM_CCMR2_OFF)
#define TIM2_CCER  STM32_REG32(TIM2_BASE + TIM_CCER_OFF)
#define TIM2_CNT   STM32_REG32(TIM2_BASE + TIM_CNT_OFF)
#define TIM2_PSC   STM32_REG32(TIM2_BASE + TIM_PSC_OFF)
#define TIM2_ARR   STM32_REG32(TIM2_BASE + TIM_ARR_OFF)
#define TIM2_CCR1  STM32_REG32(TIM2_BASE + TIM_CCR1_OFF)
#define TIM2_CCR2  STM32_REG32(TIM2_BASE + TIM_CCR2_OFF)
#define TIM2_CCR3  STM32_REG32(TIM2_BASE + TIM_CCR3_OFF)
#define TIM2_CCR4  STM32_REG32(TIM2_BASE + TIM_CCR4_OFF)

