pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
// TIM5 — 32-bit free-running counter (CKP input capture)
#define TIM5_CR1   STM32_REG32(TIM5_BASE + TIM_CR1_OFF)
#define TIM5_DIER  STM32_REG32(TIM5_BASE + TIM_DIER_OFF)
#define TIM5_SR    STM32_REG32(TIM5_BASE + TIM_SR_OFF)
#define TIM5_CCMR1 STM32_REG32(TIM5_BASE + TIM_CCMR1_OFF)
#define TIM5_CCER  STM32_REG32(TIM5_BASE + TIM_CCER_OFF)
#define TIM5_CNT   STM32_REG32(TIM5_BASE + TIM_CNT_OFF)
#define TIM5_PSC   STM32_REG32(TIM5_BASE + TIM_PSC_OFF)
#define TIM5_ARR   STM32_REG32(TIM5_BASE + TIM_ARR_OFF)
#define TIM5_CCR1  STM32_REG32(TIM5_BASE + TIM_CCR1_OFF)  // CKP timestamp travado
#define TIM5_CCR2  STM32_REG32(TIM5_BASE + TIM_CCR2_OFF)  // CMP timestamp travado
#define TIM5_EGR   STM32_REG32(TIM5_BASE + TIM_EGR_OFF)

// TIM8 — advanced timer (kept for reference; ignition migrated to TIM1 on LQFP100)
#define TIM8_CR1   STM32_REG32(TIM8_BASE + TIM_CR1_OFF)
#define TIM8_DIER  STM32_REG32(TIM8_BASE + TIM_DIER_OFF)
#define TIM8_SR    STM32_REG32(TIM8_BASE + TIM_SR_OFF)
#define TIM8_EGR   STM32_REG32(TIM8_BASE + TIM_EGR_OFF)
#define TIM8_CCMR1 STM32_REG32(TIM8_BASE + TIM_CCMR1_OFF)
#define TIM8_CCMR2 STM32_REG32(TIM8_BASE + TIM_CCMR2_OFF)
#define TIM8_CCER  STM32_REG32(TIM8_BASE + TIM_CCER_OFF)
#define TIM8_CNT   STM32_REG32(TIM8_BASE + TIM_CNT_OFF)
#define TIM8_PSC   STM32_REG32(TIM8_BASE + TIM_PSC_OFF)
#define TIM8_ARR   STM32_REG32(TIM8_BASE + TIM_ARR_OFF)
#define TIM8_CCR1  STM32_REG32(TIM8_BASE + TIM_CCR1_OFF)
#define TIM8_CCR2  STM32_REG32(TIM8_BASE + TIM_CCR2_OFF)
#define TIM8_CCR3  STM32_REG32(TIM8_BASE + TIM_CCR3_OFF)
#define TIM8_CCR4  STM32_REG32(TIM8_BASE + TIM_CCR4_OFF)
#define TIM8_BDTR  STM32_REG32(TIM8_BASE + TIM_BDTR_OFF)

// TIM3 — PWM (Wastegate CH2)
#define TIM3_CR1   STM32_REG32(TIM3_BASE + TIM_CR1_OFF)
#define TIM3_CR2   STM32_REG32(TIM3_BASE + TIM_CR2_OFF)
#define TIM3_SR    STM32_REG32(TIM3_BASE + TIM_SR_OFF)
#define TIM3_CCMR1 STM32_REG32(TIM3_BASE + TIM_CCMR1_OFF)
#define TIM3_CCER  STM32_REG32(TIM3_BASE + TIM_CCER_OFF)
#define TIM3_CNT   STM32_REG32(TIM3_BASE + TIM_CNT_OFF)
#define TIM3_PSC   STM32_REG32(TIM3_BASE + TIM_PSC_OFF)
#define TIM3_ARR   STM32_REG32(TIM3_BASE + TIM_ARR_OFF)
#define TIM3_DIER  STM32_REG32(TIM3_BASE + TIM_DIER_OFF)
#define TIM3_CCMR2 STM32_REG32(TIM3_BASE + TIM_CCMR2_OFF)
#define TIM3_CCR1  STM32_REG32(TIM3_BASE + TIM_CCR1_OFF)
#define TIM3_CCR2  STM32_REG32(TIM3_BASE + TIM_CCR2_OFF)
#define TIM3_CCR3  STM32_REG32(TIM3_BASE + TIM_CCR3_OFF)
#define TIM3_CCR4  STM32_REG32(TIM3_BASE + TIM_CCR4_OFF)
#define TIM3_EGR   STM32_REG32(TIM3_BASE + TIM_EGR_OFF)

// TIM4 — PWM (VVT Exhaust CH1 + VVT Intake CH2)
#define TIM4_CR1   STM32_REG32(TIM4_BASE + TIM_CR1_OFF)
#define TIM4_CR2   STM32_REG32(TIM4_BASE + TIM_CR2_OFF)
#define TIM4_SR    STM32_REG32(TIM4_BASE + TIM_SR_OFF)
#define TIM4_CCMR1 STM32_REG32(TIM4_BASE + TIM_CCMR1_OFF)
#define TIM4_CCER  STM32_REG32(TIM4_BASE + TIM_CCER_OFF)
#define TIM4_CNT   STM32_REG32(TIM4_BASE + TIM_CNT_OFF)
#define TIM4_PSC   STM32_REG32(TIM4_BASE + TIM_PSC_OFF)
#define TIM4_ARR   STM32_REG32(TIM4_BASE + TIM_ARR_OFF)
#define TIM4_CCR1  STM32_REG32(TIM4_BASE + TIM_CCR1_OFF)
#define TIM4_CCR2  STM32_REG32(TIM4_BASE + TIM_CCR2_OFF)
#define TIM4_EGR   STM32_REG32(TIM4_BASE + TIM_EGR_OFF)

// TIM6 — basic timer (ADC TRGO trigger)
#define TIM6_CR1   STM32_REG32(TIM6_BASE + TIM_CR1_OFF)
#define TIM6_CR2   STM32_REG32(TIM6_BASE + TIM_CR2_OFF)
#define TIM6_SR    STM32_REG32(TIM6_BASE + TIM_SR_OFF)
#define TIM6_CNT   STM32_REG32(TIM6_BASE + TIM_CNT_OFF)
#define TIM6_PSC   STM32_REG32(TIM6_BASE + TIM_PSC_OFF)
#define TIM6_ARR   STM32_REG32(TIM6_BASE + TIM_ARR_OFF)
#define TIM6_EGR   STM32_REG32(TIM6_BASE + TIM_EGR_OFF)

// TIM15 — advanced timer (ETB PWM on PE5, LQFP100)
#define TIM15_BASE   0x40014000UL
#define RCC_APB2ENR_TIM15EN (1u << 16)
#define TIM15_CR1   STM32_REG32(TIM15_BASE + TIM_CR1_OFF)
#define TIM15_EGR   STM32_REG32(TIM15_BASE + TIM_EGR_OFF)
#define TIM15_CCMR1 STM32_REG32(TIM15_BASE + TIM_CCMR1_OFF)
#define TIM15_CCER  STM32_REG32(TIM15_BASE + TIM_CCER_OFF)
#define TIM15_PSC   STM32_REG32(TIM15_BASE + TIM_PSC_OFF)
#define TIM15_ARR   STM32_REG32(TIM15_BASE + TIM_ARR_OFF)
#define TIM15_CCR1  STM32_REG32(TIM15_BASE + TIM_CCR1_OFF)
#define TIM15_BDTR  STM32_REG32(TIM15_BASE + TIM_BDTR_OFF)

// ─── ADC (RM0481 §25) ─────────────────────────────────────────────────────────
#define ADC_ISR_OFF    0x00UL
#define ADC_IER_OFF    0x04UL
#define ADC_CR_OFF     0x08UL
#define ADC_CFGR1_OFF  0x0CUL
#define ADC_CFGR2_OFF  0x10UL
#define ADC_SMPR1_OFF  0x14UL
#define ADC_SMPR2_OFF  0x18UL
#define ADC_SQR1_OFF   0x30UL
#define ADC_SQR2_OFF   0x34UL
#define ADC_SQR3_OFF   0x38UL
#define ADC_SQR4_OFF   0x3CUL
#define ADC_DR_OFF     0x40UL
#define ADC_OFR1_OFF   0x60UL

// Common registers (ADC1+ADC2 shared)
#define ADC12_CCR_OFF  0x08UL

#define ADC1_ISR   STM32_REG32(ADC1_BASE + ADC_ISR_OFF)
#define ADC1_CR    STM32_REG32(ADC1_BASE + ADC_CR_OFF)
#define ADC1_CFGR1 STM32_REG32(ADC1_BASE + ADC_CFGR1_OFF)
#define ADC1_CFGR2 STM32_REG32(ADC1_BASE + ADC_CFGR2_OFF)
#define ADC1_SMPR1 STM32_REG32(ADC1_BASE + ADC_SMPR1_OFF)
#define ADC1_SMPR2 STM32_REG32(ADC1_BASE + ADC_SMPR2_OFF)
#define ADC1_SQR1  STM32_REG32(ADC1_BASE + ADC_SQR1_OFF)
#define ADC1_SQR2  STM32_REG32(ADC1_BASE + ADC_SQR2_OFF)
#define ADC1_DR    STM32_REG32(ADC1_BASE + ADC_DR_OFF)

#define ADC2_ISR   STM32_REG32(ADC2_BASE + ADC_ISR_OFF)
#define ADC2_CR    STM32_REG32(ADC2_BASE + ADC_CR_OFF)
#define ADC2_CFGR1 STM32_REG32(ADC2_BASE + ADC_CFGR1_OFF)
#define ADC2_CFGR2 STM32_REG32(ADC2_BASE + ADC_CFGR2_OFF)
#define ADC2_SMPR1 STM32_REG32(ADC2_BASE + ADC_SMPR1_OFF)
#define ADC2_SMPR2 STM32_REG32(ADC2_BASE + ADC_SMPR2_OFF)
#define ADC2_SQR1  STM32_REG32(ADC2_BASE + ADC_SQR1_OFF)
#define ADC2_SQR2  STM32_REG32(ADC2_BASE + ADC_SQR2_OFF)
#define ADC2_DR    STM32_REG32(ADC2_BASE + ADC_DR_OFF)

#define ADC12_CCR  STM32_REG32(ADC12_COMMON + ADC12_CCR_OFF)

// ADC_CR bits
#define ADC_CR_ADEN    (1u << 0)
#define ADC_CR_ADDIS   (1u << 1)
#define ADC_CR_ADSTART (1u << 2)
#define ADC_CR_ADSTP   (1u << 4)
#define ADC_CR_ADCAL   (1u << 31)
#define ADC_CR_ADCALDIF (1u << 30)
#define ADC_CR_DEEPPWD (1u << 29)
#define ADC_CR_ADVREGEN (1u << 28)

// ADC_ISR bits
#define ADC_ISR_ADRDY  (1u << 0)
#define ADC_ISR_EOC    (1u << 2)
#define ADC_ISR_EOS    (1u << 3)

