pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
// ADC_IER — interrupt enable register (offset 0x04)
#define ADC_IER_OFF    0x04UL
#define ADC_IER_EOCIE  (1u << 2)   // End of conversion interrupt enable
#define ADC_IER_EOSIE  (1u << 3)   // End of sequence interrupt enable
#define ADC1_IER  STM32_REG32(ADC1_BASE + ADC_IER_OFF)
#define ADC2_IER  STM32_REG32(ADC2_BASE + ADC_IER_OFF)

// ADC_CFGR1 bits
#define ADC_CFGR1_DMAEN (1u << 0)
#define ADC_CFGR1_DMACFG (1u << 1)
#define ADC_CFGR1_RES_12BIT  (0u << 2)
#define ADC_CFGR1_RES_10BIT  (1u << 2)
#define ADC_CFGR1_EXTEN_RISING (1u << 10)
// EXTSEL[4:0] = 0b01101 → TIM6_TRGO (ver RM0481 Tab.125)
#define ADC_CFGR1_EXTSEL_TIM6_TRGO (13u << 5)
#define ADC_CFGR1_OVRMOD (1u << 12)  // 1 = overrun sobrescreve DR (não trava ADSTART)
#define ADC_CFGR1_CONT   (1u << 13)
#define ADC_CFGR1_DISCEN (1u << 16)

// ADC12_CCR bits
#define ADC12_CCR_CKMODE_HCLK_DIV4 (3u << 16)  // CKMODE[1:0] = 11 → adc_hclk/4
#define ADC12_CCR_PRESC_DIV4       (2u << 18)  // Async PRESC /4 (unused with CKMODE != 0)

// ─── GPDMA1 (RM0481 §16) ─────────────────────────────────────────────────────
#define GPDMA_CH_STRIDE 0x80UL
#define GPDMA_CH0_BASE  (GPDMA1_BASE + 0x050UL)
#define GPDMA_CH1_BASE  (GPDMA1_BASE + 0x0D0UL)

#define GPDMA_CLLBAR_OFF 0x00UL
#define GPDMA_CFCR_OFF   0x0CUL
#define GPDMA_CSR_OFF    0x10UL
#define GPDMA_CCR_OFF    0x14UL
#define GPDMA_CTR1_OFF   0x40UL
#define GPDMA_CTR2_OFF   0x44UL
#define GPDMA_CBR1_OFF   0x48UL
#define GPDMA_CSAR_OFF   0x4CUL
#define GPDMA_CDAR_OFF   0x50UL
#define GPDMA_CTR3_OFF   0x54UL
#define GPDMA_CBR2_OFF   0x58UL
#define GPDMA_CLLR_OFF   0x7CUL

#define GPDMA_REG(ch_base, off) STM32_REG32((ch_base) + (off))
#define GPDMA1_CH0_CFCR GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CFCR_OFF)
#define GPDMA1_CH0_CSR  GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CSR_OFF)
#define GPDMA1_CH0_CCR  GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CCR_OFF)
#define GPDMA1_CH0_CTR1 GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CTR1_OFF)
#define GPDMA1_CH0_CTR2 GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CTR2_OFF)
#define GPDMA1_CH0_CBR1 GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CBR1_OFF)
#define GPDMA1_CH0_CSAR GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CSAR_OFF)
#define GPDMA1_CH0_CDAR GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CDAR_OFF)
#define GPDMA1_CH0_CTR3 GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CTR3_OFF)
#define GPDMA1_CH0_CBR2 GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CBR2_OFF)
#define GPDMA1_CH0_CLLR GPDMA_REG(GPDMA_CH0_BASE, GPDMA_CLLR_OFF)

#define GPDMA1_CH1_CFCR GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CFCR_OFF)
#define GPDMA1_CH1_CSR  GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CSR_OFF)
#define GPDMA1_CH1_CCR  GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CCR_OFF)
#define GPDMA1_CH1_CTR1 GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CTR1_OFF)
#define GPDMA1_CH1_CTR2 GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CTR2_OFF)
#define GPDMA1_CH1_CBR1 GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CBR1_OFF)
#define GPDMA1_CH1_CSAR GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CSAR_OFF)
#define GPDMA1_CH1_CDAR GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CDAR_OFF)
#define GPDMA1_CH1_CTR3 GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CTR3_OFF)
#define GPDMA1_CH1_CBR2 GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CBR2_OFF)
#define GPDMA1_CH1_CLLR GPDMA_REG(GPDMA_CH1_BASE, GPDMA_CLLR_OFF)

#define GPDMA_CCR_EN      (1u << 0)
#define GPDMA_CCR_RESET   (1u << 1)
#define GPDMA_CCR_TCIE    (1u << 8)
#define GPDMA_CCR_DTEIE   (1u << 10)
#define GPDMA_CCR_USEIE   (1u << 12)
#define GPDMA_CCR_PRIO_HIGH (2u << 22)
// Continuidade no GPDMA do H5 é via linked-list (LLI em RAM apontada por
// CLLBAR+CLLR), NÃO por um bit circular no CCR. Update bits do CLLR (RM0481/CMSIS):
#define GPDMA_CLLR_LA_MASK 0x0000FFFCu  // LA[15:2] — endereço (low) do próximo LLI
#define GPDMA_CLLR_ULL    (1u << 16)    // recarrega CLLR do LLI
#define GPDMA_CLLR_UDA    (1u << 27)    // recarrega CDAR do LLI
#define GPDMA_CLLR_UB1    (1u << 29)    // recarrega CBR1 do LLI

#define GPDMA_CSR_TCF     (1u << 8)
#define GPDMA_CSR_DTEF    (1u << 10)
#define GPDMA_CSR_USEF    (1u << 12)
#define GPDMA_CFCR_ALL    (GPDMA_CSR_TCF | (1u << 9) | GPDMA_CSR_DTEF | (1u << 11) | GPDMA_CSR_USEF | (1u << 13) | (1u << 14))

#define GPDMA_CTR1_HALFWORD_TO_HALFWORD_INC_DEST \
    ((1u << 0) | (1u << 16) | (1u << 19))
#define GPDMA_CTR2_REQSEL_ADC1 0u
#define GPDMA_CTR2_REQSEL_ADC2 1u
#define GPDMA_CTR2_TCEM_BLOCK  0u

// ─── FDCAN1 (RM0481 §51) ──────────────────────────────────────────────────────
#define FDCAN_CCCR_OFF   0x018UL   // CC Control Register
#define FDCAN_NBTP_OFF   0x01CUL   // Nominal Bit Timing
#define FDCAN_DBTP_OFF   0x00CUL   // Data Bit Timing
#define FDCAN_RXGFC_OFF  0x080UL   // Global Filter Config
#define FDCAN_TXBC_OFF   0x0C0UL   // TX Buffer Config
#define FDCAN_TXFQS_OFF  0x0C4UL   // TX FIFO/Queue Status
#define FDCAN_TXBRP_OFF  0x0CCUL   // TX Buffer Request Pending
#define FDCAN_TXBAR_OFF  0x0D0UL   // TX Buffer Add Request
#define FDCAN_RXF0C_OFF  0x0A0UL   // RX FIFO0 Config
#define FDCAN_RXF0S_OFF  0x0A4UL   // RX FIFO0 Status
#define FDCAN_RXF0A_OFF  0x0A8UL   // RX FIFO0 Acknowledge
#define FDCAN_IR_OFF     0x050UL   // Interrupt Register
#define FDCAN_IE_OFF     0x054UL   // Interrupt Enable
#define FDCAN_ILE_OFF    0x05CUL   // Interrupt Line Enable
#define FDCAN_SHPAM_OFF  0x094UL   // Standard ID filter area

#define FDCAN1_CCCR  STM32_REG32(FDCAN1_BASE + FDCAN_CCCR_OFF)
#define FDCAN1_NBTP  STM32_REG32(FDCAN1_BASE + FDCAN_NBTP_OFF)
#define FDCAN1_RXGFC STM32_REG32(FDCAN1_BASE + FDCAN_RXGFC_OFF)
#define FDCAN1_TXBC  STM32_REG32(FDCAN1_BASE + FDCAN_TXBC_OFF)
#define FDCAN1_TXFQS STM32_REG32(FDCAN1_BASE + FDCAN_TXFQS_OFF)
#define FDCAN1_TXBRP STM32_REG32(FDCAN1_BASE + FDCAN_TXBRP_OFF)
#define FDCAN1_TXBAR STM32_REG32(FDCAN1_BASE + FDCAN_TXBAR_OFF)
#define FDCAN1_RXF0C STM32_REG32(FDCAN1_BASE + FDCAN_RXF0C_OFF)
#define FDCAN1_RXF0S STM32_REG32(FDCAN1_BASE + FDCAN_RXF0S_OFF)
#define FDCAN1_RXF0A STM32_REG32(FDCAN1_BASE + FDCAN_RXF0A_OFF)
#define FDCAN1_IR    STM32_REG32(FDCAN1_BASE + FDCAN_IR_OFF)
#define FDCAN1_IE    STM32_REG32(FDCAN1_BASE + FDCAN_IE_OFF)

// FDCAN_CCCR bits
#define FDCAN_CCCR_INIT  (1u << 0)
#define FDCAN_CCCR_CCE   (1u << 1)    // Config Change Enable
#define FDCAN_CCCR_ASM   (1u << 2)    // Restricted Operation Mode
#define FDCAN_CCCR_CSA   (1u << 3)    // Clock Stop Acknowledge
#define FDCAN_CCCR_CSR   (1u << 4)    // Clock Stop Request
#define FDCAN_CCCR_MON   (1u << 5)    // Bus Monitoring Mode
#define FDCAN_CCCR_DAR   (1u << 6)    // Disable Automatic Retransmission
#define FDCAN_CCCR_TEST  (1u << 7)    // Test Mode Enable
#define FDCAN_CCCR_FDOE  (1u << 8)    // FD Operation Enable
#define FDCAN_CCCR_BRSE  (1u << 9)    // Bit Rate Switch Enable

// ─── USART1 / USART2 (RM0481 §49) ────────────────────────────────────────────
#define USART_CR1_OFF  0x00UL
#define USART_CR2_OFF  0x04UL
#define USART_CR3_OFF  0x08UL
#define USART_BRR_OFF  0x0CUL
#define USART_ISR_OFF  0x1CUL
#define USART_ICR_OFF  0x20UL
#define USART_RDR_OFF  0x24UL
#define USART_TDR_OFF  0x28UL

#define USART1_CR1 STM32_REG32(USART1_BASE + USART_CR1_OFF)
#define USART1_CR2 STM32_REG32(USART1_BASE + USART_CR2_OFF)
#define USART1_CR3 STM32_REG32(USART1_BASE + USART_CR3_OFF)
#define USART1_BRR STM32_REG32(USART1_BASE + USART_BRR_OFF)
#define USART1_ISR STM32_REG32(USART1_BASE + USART_ISR_OFF)
#define USART1_ICR STM32_REG32(USART1_BASE + USART_ICR_OFF)
#define USART1_RDR STM32_REG32(USART1_BASE + USART_RDR_OFF)
#define USART1_TDR STM32_REG32(USART1_BASE + USART_TDR_OFF)

// USART2 — registradores (reservado; PA2/PA3 são ADC)
#define USART2_CR1 STM32_REG32(USART2_BASE + USART_CR1_OFF)
#define USART2_CR2 STM32_REG32(USART2_BASE + USART_CR2_OFF)
#define USART2_CR3 STM32_REG32(USART2_BASE + USART_CR3_OFF)
#define USART2_BRR STM32_REG32(USART2_BASE + USART_BRR_OFF)
#define USART2_ISR STM32_REG32(USART2_BASE + USART_ISR_OFF)
#define USART2_ICR STM32_REG32(USART2_BASE + USART_ICR_OFF)
#define USART2_RDR STM32_REG32(USART2_BASE + USART_RDR_OFF)
#define USART2_TDR STM32_REG32(USART2_BASE + USART_TDR_OFF)

// USART3 — nao usado no MVP; PB10/PB11 pertencem a TIM2_CH3/CH4
#define USART3_BASE  0x40004800UL
#define RCC_APB1LENR_USART3EN  (1u << 18)
#define USART3_CR1 STM32_REG32(USART3_BASE + USART_CR1_OFF)
#define USART3_CR2 STM32_REG32(USART3_BASE + USART_CR2_OFF)
#define USART3_CR3 STM32_REG32(USART3_BASE + USART_CR3_OFF)
#define USART3_BRR STM32_REG32(USART3_BASE + USART_BRR_OFF)
#define USART3_ISR STM32_REG32(USART3_BASE + USART_ISR_OFF)
#define USART3_ICR STM32_REG32(USART3_BASE + USART_ICR_OFF)
#define USART3_RDR STM32_REG32(USART3_BASE + USART_RDR_OFF)
#define USART3_TDR STM32_REG32(USART3_BASE + USART_TDR_OFF)

