pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
// USART_CR1 bits
#define USART_CR1_UE    (1u << 0)
#define USART_CR1_RE    (1u << 2)
#define USART_CR1_TE    (1u << 3)
#define USART_CR1_FIFOEN (1u << 29)

// USART_ISR bits
#define USART_ISR_PE    (1u << 0)   // Parity error
#define USART_ISR_FE    (1u << 1)   // Framing error
#define USART_ISR_NE    (1u << 2)   // Noise detection flag
#define USART_ISR_ORE   (1u << 3)   // Overrun error
#define USART_ISR_RXNE  (1u << 5)   // RX not empty (data available)
#define USART_ISR_TC    (1u << 6)   // Transmission complete
#define USART_ICR_PECF  (1u << 0)
#define USART_ICR_FECF  (1u << 1)
#define USART_ICR_NECF  (1u << 2)
#define USART_ICR_ORECF (1u << 3)
#define USART_ISR_TXE   (1u << 7)   // TX register empty

// ─── IWDG (Independent Watchdog, RM0481 §35) ─────────────────────────────────
#define IWDG_KR_OFF   0x00UL
#define IWDG_PR_OFF   0x04UL
#define IWDG_RLR_OFF  0x08UL
#define IWDG_SR_OFF   0x0CUL

#define IWDG_KR  STM32_REG32(IWDG_BASE + IWDG_KR_OFF)
#define IWDG_PR  STM32_REG32(IWDG_BASE + IWDG_PR_OFF)
#define IWDG_RLR STM32_REG32(IWDG_BASE + IWDG_RLR_OFF)
#define IWDG_SR  STM32_REG32(IWDG_BASE + IWDG_SR_OFF)
#define IWDG_SR_PVU  (1u << 0u)   // prescaler update in progress
#define IWDG_SR_RVU  (1u << 1u)   // reload value update in progress

#define IWDG_KR_REFRESH  0xAAAAu
#define IWDG_KR_ACCESS   0x5555u
#define IWDG_KR_START    0xCCCCu

// IWDG_PR: prescaler para ~100ms a 32 kHz LSI
// Prescaler /32 → 32000/32 = 1000 Hz → RLR = 100 → 100 ms
#define IWDG_PR_DIV32    0x3u
#define IWDG_PR_DIV256   0x6u    // /256 → 125 Hz @ 32 kHz LSI
#define IWDG_RLR_100MS   99u
#define IWDG_RLR_1S      999u    // com /32 → 1s
#define IWDG_RLR_10S     1249u   // com /256 → 10s (boot completo + margem)

// ─── Flash (RM0481 §7) ───────────────────────────────────────────────────────
#define FLASH_ACR_OFF     0x000UL
#define FLASH_OPTCR_OFF   0x004UL
#define FLASH_SR1_OFF     0x020UL   // Flash Bank1 status
#define FLASH_SR2_OFF     0x120UL   // Flash Bank2 status
#define FLASH_CR1_OFF     0x028UL
#define FLASH_CR2_OFF     0x128UL
#define FLASH_CCR1_OFF    0x030UL
#define FLASH_CCR2_OFF    0x130UL
#define FLASH_KEYR1_OFF   0x004UL
#define FLASH_KEYR2_OFF   0x104UL

#define FLASH_ACR  STM32_REG32(FLASH_BASE + FLASH_ACR_OFF)
#define FLASH_SR2  STM32_REG32(FLASH_BASE + FLASH_SR2_OFF)
#define FLASH_CR2  STM32_REG32(FLASH_BASE + FLASH_CR2_OFF)
#define FLASH_CCR2 STM32_REG32(FLASH_BASE + FLASH_CCR2_OFF)
#define FLASH_KEYR2 STM32_REG32(FLASH_BASE + FLASH_KEYR2_OFF)

// Flash_SR bits
#define FLASH_SR_BSY   (1u << 0)
#define FLASH_SR_WBNE  (1u << 1)   // Write buffer not empty
#define FLASH_SR_DBNE  (1u << 3)   // Data buffer not empty
#define FLASH_SR_EOP   (1u << 16)  // End of program
#define FLASH_SR_PGSERR (1u << 18) // Program sequence error
#define FLASH_SR_WRPERR (1u << 17) // Write protection error

// Flash_CR bits
#define FLASH_CR_LOCK  (1u << 0)
#define FLASH_CR_PG    (1u << 1)   // Programming enable
#define FLASH_CR_SER   (1u << 2)   // Sector erase
#define FLASH_CR_BER   (1u << 3)   // Bank erase
#define FLASH_CR_STRT  (1u << 5)   // Erase start
#define FLASH_CR_SNB_SHIFT 6       // Sector number [3:0] @ bits [9:6]

// Flash_ACR: latency / prefetch
// FLASH_ACR no H5 (CMSIS verified): LATENCY[3:0], WRHIGHFREQ[5:4], PRFTEN(8).
// ICEN/DCEN (bits 9/10, herdados de F4/H7) NÃO existem no H5 — removidos.
// WRHIGHFREQ é OBRIGATÓRIO: 0b10 para 150<HCLK≤250MHz; sem ele a flash
// retorna lixo a 250MHz (crash logo após o switch para PLL).
#define FLASH_ACR_LATENCY_5WS    (5u << 0)
#define FLASH_ACR_WRHIGHFREQ_MSK (3u << 4)
#define FLASH_ACR_WRHIGHFREQ_250 (2u << 4)   // 0b10: 150-250 MHz
#define FLASH_ACR_PRFTEN         (1u << 8)

// Flash Bank2 base address
// STM32H562RG = 1 MB flash (DFU: 128 setores × 8KB). Bank1 0x08000000-0x0807FFFF,
// Bank2 0x08080000-0x080FFFFF. O valor antigo 0x08100000 (chip de 2MB) está FORA
// da flash → leitura travava o barramento AHB (bus stall, sem fault).
#define FLASH_BANK2_BASE  0x08080000UL
#define FLASH_SECTOR_SIZE 0x00002000UL  // 8 KB por setor no H562

// ─── NVIC helpers (ARM Cortex-M33 NVIC — idêntico ao M4) ────────────────────
#define NVIC_ISER_BASE  0xE000E100UL
#define NVIC_IPR_BASE   0xE000E400UL
#define NVIC_ICPR_BASE  0xE000E280UL

static inline void nvic_enable_irq(uint8_t irq) noexcept {
    STM32_REG32(NVIC_ISER_BASE + (irq / 32u) * 4u) = (1u << (irq % 32u));
}

static inline void nvic_set_priority(uint8_t irq, uint8_t prio) noexcept {
    // Prioridade nos 4 bits superiores do byte IPR (como no STM32)
    volatile uint32_t* ipr = reinterpret_cast<volatile uint32_t*>(
        NVIC_IPR_BASE + (irq / 4u) * 4u);
    uint32_t sh = (irq % 4u) * 8u;
    *ipr = (*ipr & ~(0xFFu << sh)) | (static_cast<uint32_t>(prio) << (sh + 4u));
}

// IRQ numbers — STM32H562 (RM0481 §Table 87 / cmsis-device-h5 stm32h562xx.h)
// Valores confirmados contra TIM5_IRQn=48 etc.; scheduler usa TIM2/TIM8 sem ISR no caminho crítico.
// NOTE: STM32H562 has NO analog comparator (COMP) peripheral — confirmed
// in CMSIS header stm32h562xx.h (no COMP1_IRQn entry). IRQ64 = LPTIM1.
// Knock sensor must use an external comparator routed to a GPIO/EXTI line.
// IRQ_COMP1 is intentionally undefined; update knock.cpp when hardware is known.
#define IRQ_TIM2         45u   // TIM2 global (injection output compare)
#define IRQ_TIM5         48u   // TIM5 global (CKP input capture)
#define IRQ_TIM1_CC      44u   // TIM1 capture/compare (ignition OC match)
#define IRQ_TIM3         46u   // TIM3 global (injection OC match)
#define IRQ_TIM4         47u   // TIM4 (PWM VVT — não usa IRQ)
#define IRQ_ADC1         37u   // ADC1 (IRQ separado do ADC2)
#define IRQ_ADC2         69u   // ADC2 (IRQ separado do ADC1)
#define IRQ_GPDMA1_CH0   27u   // GPDMA1 channel 0
#define IRQ_GPDMA1_CH1   28u   // GPDMA1 channel 1
#define IRQ_FDCAN1_IT0   39u   // FDCAN1 interrupt line 0
// SysTick não usa NVIC — configurado via SCB->SHP diretamente (ARM core)

// ─── USB DRD FS (RM0481 §52.7) ───────────────────────────────────────────────
// Base: APB2 @ 0x40016000
// Packet Buffer Area: 0x40016C00 (2 KB)
#define USB_BASE     0x40016000UL
// PMA base: USB_DRD_PMAADDR_NS = APB2PERIPH_BASE_NS + 0x6400 = 0x40016400
// Confirmed from stm32h562xx.h (was incorrectly 0x40016C00)
#define USB_PBA_BASE 0x40016400UL

// Channel/Endpoint registers (USB_CHEPxR) — one per endpoint
#define USB_CHEP0R  STM32_REG32(USB_BASE + 0x00UL)
#define USB_CHEP1R  STM32_REG32(USB_BASE + 0x04UL)
#define USB_CHEP2R  STM32_REG32(USB_BASE + 0x08UL)
#define USB_CHEP3R  STM32_REG32(USB_BASE + 0x0CUL)

