pbuchabqui/OpenEMS/src/hal/stm32h562/regs.h
// Control/Status registers
#define USB_CNTR    STM32_REG32(USB_BASE + 0x40UL)  // Control
#define USB_ISTR    STM32_REG32(USB_BASE + 0x44UL)  // Interrupt Status
#define USB_FNR     STM32_REG32(USB_BASE + 0x48UL)  // Frame Number
#define USB_DADDR   STM32_REG32(USB_BASE + 0x4CUL)  // Device Address
#define USB_BTABLE  STM32_REG32(USB_BASE + 0x50UL)  // Buffer Table base addr (in PBA words)
#define USB_LPMCSR  STM32_REG32(USB_BASE + 0x54UL)  // LPM Control/Status
#define USB_BCDR    STM32_REG32(USB_BASE + 0x58UL)  // Battery Charging Detect

// USB_CNTR bits
#define USB_CNTR_USBRST  (1u << 0)   // USB Reset (apply then clear)
#define USB_CNTR_PDWN    (1u << 1)   // Power down (1=off, 0=active)
#define USB_CNTR_FSUSP   (1u << 3)   // Force suspend
#define USB_CNTR_RESUME  (1u << 4)   // Resume request
#define USB_CNTR_RESETM  (1u << 10)  // Reset interrupt enable
#define USB_CNTR_SUSPM   (1u << 11)  // Suspend interrupt enable
#define USB_CNTR_WKUPM  (1u << 12)  // Wakeup interrupt enable
#define USB_CNTR_CTRM    (1u << 15)  // Correct Transfer interrupt enable

// USB_ISTR bits
#define USB_ISTR_EP_ID   (0xFu << 0) // Endpoint ID mask
#define USB_ISTR_DIR     (1u << 4)   // Direction (0=IN, 1=OUT/SETUP)
#define USB_ISTR_ESOF    (1u << 8)
#define USB_ISTR_SOF     (1u << 9)
#define USB_ISTR_RESET   (1u << 10)  // USB Reset received
#define USB_ISTR_SUSP    (1u << 11)  // Suspend
#define USB_ISTR_WKUP    (1u << 12)  // Wakeup
#define USB_ISTR_CTR     (1u << 15)  // Correct Transfer

// USB_DADDR bits
#define USB_DADDR_EF     (1u << 7)   // Enable function

// USB_CHEPxR bit fields
// EA[3:0]       bits 3:0   endpoint address
// STAT_TX[1:0]  bits 5:4   TX status: 00=disabled,01=stall,10=NAK,11=VALID
// DTOG_TX       bit 6      TX data toggle
// CTR_TX        bit 7      Correct TX (RC_W0)
// EP_KIND       bit 8      (0=normal, 1=double-buffer or STATUS_OUT for ctrl)
// EP_TYPE[1:0]  bits 10:9  00=Bulk, 01=Control, 10=Iso, 11=Interrupt
// SETUP         bit 11     SETUP packet flag (r/o)
// STAT_RX[1:0]  bits 13:12 RX status
// DTOG_RX       bit 14     RX data toggle
// CTR_RX        bit 15     Correct RX (RC_W0)
#define USB_EP_STAT_TX_DISABLED  (0u << 4)
#define USB_EP_STAT_TX_STALL     (1u << 4)
#define USB_EP_STAT_TX_NAK       (2u << 4)
#define USB_EP_STAT_TX_VALID     (3u << 4)
#define USB_EP_STAT_TX_MASK      (3u << 4)
#define USB_EP_DTOG_TX           (1u << 6)
#define USB_EP_CTR_TX            (1u << 7)
#define USB_EP_TYPE_BULK         (0u << 9)
#define USB_EP_TYPE_CTRL         (1u << 9)
#define USB_EP_TYPE_ISO          (2u << 9)
#define USB_EP_TYPE_INT          (3u << 9)
#define USB_EP_TYPE_MASK         (3u << 9)
#define USB_EP_SETUP             (1u << 11)
#define USB_EP_STAT_RX_DISABLED  (0u << 12)
#define USB_EP_STAT_RX_STALL     (1u << 12)
#define USB_EP_STAT_RX_NAK       (2u << 12)
#define USB_EP_STAT_RX_VALID     (3u << 12)
#define USB_EP_STAT_RX_MASK      (3u << 12)
#define USB_EP_DTOG_RX           (1u << 14)
#define USB_EP_CTR_RX            (1u << 15)
// Invariant bits that must be preserved (write 1) when writing CHEPxR:
#define USB_EP_INVARIANT         (USB_EP_CTR_RX | USB_EP_CTR_TX)

// RCC USB clock enable (APB2, bit 24)
#define RCC_APB2ENR_USBEN        (1u << 24)

// HSI48 — 48 MHz RC oscillator (clock source for USB DRD FS)
// Confirmed: RCC_CR bits 12/13 from stm32h562xx.h
#define RCC_CR_HSI48ON   (1u << 12)
#define RCC_CR_HSI48RDY  (1u << 13)

// RCC_CCIPR4: peripheral kernel clock source selectors
// Offset 0xE4 confirmed from stm32h562xx.h struct comment "Address offset: 0xE4"
#define RCC_CCIPR4            STM32_REG32(RCC_BASE + 0x0E4UL)
// USBSEL[1:0] at bits [5:4] (mask=0x30). Encoding per ST HAL (stm32h5xx_hal_rcc_ex.h):
//   00 = NOCLOCK (no USB clock!)   01 = PLL1Q   10 = PLL3Q   11 = HSI48
// NOTE: an earlier comment here wrongly said 00=HSI48 — writing 00 leaves USB with NO
// clock and enumeration never starts. The proven golden reference uses 11 = HSI48.
// Confirmed: RCC_CCIPR4_USBSEL_Pos=4, RCC_CCIPR4_USBSEL_Msk=0x30 from stm32h562xx.h
#define RCC_CCIPR4_USBSEL_MSK   (3u << 4u)
// HSI48 selection = 0b11 (set both bits)
#define RCC_CCIPR4_USBSEL_HSI48 (3u << 4u)

// GPIO AF10 for USB DP/DM (PA11/PA12)
#define GPIO_AF10  10u

// NVIC IRQ for USB DRD FS
// USB_DRD_FS_IRQn = 74 confirmed from stm32h562xx.h (was incorrectly 73)
#define IRQ_USB  74u

// ─── CRS (Clock Recovery System) ─────────────────────────────────────────────
// CRS_BASE_NS = APB1PERIPH_BASE_NS + 0x6000 = 0x40006000
#define CRS_BASE    0x40006000UL
#define CRS_CR      STM32_REG32(CRS_BASE + 0x00UL)
#define CRS_CFGR    STM32_REG32(CRS_BASE + 0x04UL)
#define CRS_ISR     STM32_REG32(CRS_BASE + 0x08UL)
#define CRS_ICR     STM32_REG32(CRS_BASE + 0x0CUL)
// CRS_CR bits
#define CRS_CR_CEN          (1u << 5u)   // Frequency error counter enable
#define CRS_CR_AUTOTRIMEN   (1u << 6u)   // Automatic HSI48 trimming enable
// CRS_CFGR fields (from stm32h562xx.h)
// RELOAD[15:0]: 47999 = 48MHz/1kHz(USB SOF) - 1
// FELIM[23:16]: 34 (frequency error limit, from WeAct example)
// SYNCSRC[29:28] per ST HAL: 00=GPIO, 01=LSE, 10=USB SOF. USB SOF = 0b10.
// NOTE: was wrongly 0b01 (LSE) — with LSE not running, CRS never trims HSI48.
#define CRS_CFGR_SYNCSRC_USB  (2u << 28u)

// ─── SDMMC1 (RM0481 §54) ────────────────────────────────────────────────────
#define SDMMC1_BASE      0x420C8000UL
#define RCC_AHB2ENR1_SDMMC1EN (1u << 12)
#define SDMMC1_POWER     STM32_REG32(SDMMC1_BASE + 0x00UL)
#define SDMMC1_CLKCR     STM32_REG32(SDMMC1_BASE + 0x04UL)
#define SDMMC1_ARG       STM32_REG32(SDMMC1_BASE + 0x08UL)
#define SDMMC1_CMD       STM32_REG32(SDMMC1_BASE + 0x0CUL)
#define SDMMC1_RESPCMD   STM32_REG32(SDMMC1_BASE + 0x10UL)
#define SDMMC1_RESP1     STM32_REG32(SDMMC1_BASE + 0x14UL)
#define SDMMC1_RESP2     STM32_REG32(SDMMC1_BASE + 0x18UL)
#define SDMMC1_RESP3     STM32_REG32(SDMMC1_BASE + 0x1CUL)
#define SDMMC1_RESP4     STM32_REG32(SDMMC1_BASE + 0x20UL)
#define SDMMC1_DTIMER    STM32_REG32(SDMMC1_BASE + 0x24UL)
#define SDMMC1_DLEN      STM32_REG32(SDMMC1_BASE + 0x28UL)
#define SDMMC1_DCTRL     STM32_REG32(SDMMC1_BASE + 0x2CUL)
#define SDMMC1_DCOUNT    STM32_REG32(SDMMC1_BASE + 0x30UL)
#define SDMMC1_STA       STM32_REG32(SDMMC1_BASE + 0x34UL)
#define SDMMC1_ICR       STM32_REG32(SDMMC1_BASE + 0x38UL)
#define SDMMC1_MASK      STM32_REG32(SDMMC1_BASE + 0x3CUL)
#define SDMMC1_ACKTIME   STM32_REG32(SDMMC1_BASE + 0x40UL)
#define SDMMC1_IDMACTRL  STM32_REG32(SDMMC1_BASE + 0x50UL)
#define SDMMC1_IDMABSIZE STM32_REG32(SDMMC1_BASE + 0x54UL)
#define SDMMC1_IDMABASER STM32_REG32(SDMMC1_BASE + 0x58UL)
#define SDMMC1_FIFO      STM32_REG32(SDMMC1_BASE + 0x80UL)

// SDMMC_POWER bits
#define SDMMC_POWER_PWRCTRL_ON  (3u << 0)
// SDMMC_STA bits
#define SDMMC_STA_CCRCFAIL  (1u << 0)
#define SDMMC_STA_DCRCFAIL  (1u << 1)
#define SDMMC_STA_CTIMEOUT  (1u << 2)
#define SDMMC_STA_DTIMEOUT  (1u << 3)
#define SDMMC_STA_TXUNDERR  (1u << 4)
#define SDMMC_STA_RXOVERR   (1u << 5)
#define SDMMC_STA_CMDREND   (1u << 6)
#define SDMMC_STA_CMDSENT   (1u << 7)
#define SDMMC_STA_DATAEND   (1u << 8)
#define SDMMC_STA_DBCKEND   (1u << 10)
#define SDMMC_STA_DPSMACT   (1u << 12)
#define SDMMC_STA_TXFIFOE   (1u << 18)
#define SDMMC_STA_RXFIFONE  (1u << 21)
// SDMMC_CMD bits
#define SDMMC_CMD_CPSMEN    (1u << 12)
#define SDMMC_CMD_WAITRESP_SHORT (1u << 6)
#define SDMMC_CMD_WAITRESP_LONG  (3u << 6)
// SDMMC_DCTRL bits
#define SDMMC_DCTRL_DTEN    (1u << 0)
#define SDMMC_DCTRL_DTDIR   (1u << 1)
#define SDMMC_DCTRL_DBLOCKSIZE_512 (9u << 4)
// SDMMC_CLKCR bits
#define SDMMC_CLKCR_HWFC_EN    (1u << 17)

// ─── SPI2 (RM0481 §37) ──────────────────────────────────────────────────────
#define SPI2_CR1     STM32_REG32(SPI2_BASE + 0x00UL)
#define SPI2_CR2     STM32_REG32(SPI2_BASE + 0x04UL)
#define SPI2_CFG1    STM32_REG32(SPI2_BASE + 0x08UL)
#define SPI2_CFG2    STM32_REG32(SPI2_BASE + 0x0CUL)
#define SPI2_IER     STM32_REG32(SPI2_BASE + 0x10UL)
#define SPI2_SR      STM32_REG32(SPI2_BASE + 0x14UL)
#define SPI2_IFCR    STM32_REG32(SPI2_BASE + 0x18UL)
#define SPI2_TXDR    STM32_REG32(SPI2_BASE + 0x20UL)
#define SPI2_RXDR    STM32_REG32(SPI2_BASE + 0x30UL)

// SPI_CR1
#define SPI_CR1_SPE       (1u << 0u)
#define SPI_CR1_CSTART    (1u << 9u)

// SPI_CFG1 — DSIZE[4:0] bits 0-4, MBR[30:28] prescaler
#define SPI_CFG1_DSIZE_16BIT  (15u << 0u)  // 16-bit frame

// SPI_CFG2
#define SPI_CFG2_MASTER   (1u << 22u)
#define SPI_CFG2_SSOE     (1u << 29u)
#define SPI_CFG2_SSOM     (1u << 30u)
#define SPI_CFG2_SSM      (1u << 26u)
#define SPI_CFG2_CPHA     (1u << 24u)
#define SPI_CFG2_CPOL     (1u << 25u)
#define SPI_CFG2_COMM_FULLDUPLEX  (0u << 17u)

// SPI_SR
#define SPI_SR_TXP        (1u << 1u)
#define SPI_SR_RXP        (1u << 0u)
#define SPI_SR_EOT        (1u << 3u)
#define SPI_SR_TXTF       (1u << 4u)

// SPI_IFCR
#define SPI_IFCR_EOTC     (1u << 3u)
#define SPI_IFCR_TXTFC    (1u << 4u)
